---
kind: method
id: M:Autodesk.Revit.DB.EdgeArrayArray.Insert(Autodesk.Revit.DB.EdgeArray,System.Int32)
source: html/1fb78332-2838-201e-a101-86d96dcaf807.htm
---
# Autodesk.Revit.DB.EdgeArrayArray.Insert Method

Insert the specified edge array into the array.

## Syntax (C#)
```csharp
public virtual void Insert(
	EdgeArray item,
	int index
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.EdgeArray`) - The edge array to be inserted into the array.
- **index** (`System.Int32`) - The edge array will be inserted before this index.

## Returns
Returns whether the edge array was inserted into the array.